Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/atdf/PIC32CK2051SG00144.atdf
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Coresight ROM Table Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Coresight ROM Table Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Coresight ROM Table Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="CTRL__CMD">
        <value name="NOOP" caption="No operation" value="0x0"/>
        <value name="CRC32" caption="32-bit Cyclic Redundancy Code" value="0xA500"/>
        <value name="MBIST" caption="Global Memory built-in self-test" value="0xA501"/>
      </value-group>
      <value-group name="ADDR__AMOD">
        <value name="EXIT_ON_ERROR" caption="STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises)." value="0x0"/>
        <value name="PAUSE_ON_ERROR" caption="STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step." value="0x1"/>
      </value-group>
      <value-group name="DATA__STATE">
        <value name="SET1" caption="SET1 Phase: read '0' write '1'" value="0x9"/>
        <value name="SET2" caption="SET2 Phase: read '1' write '0'" value="0xA"/>
        <value name="SET2B" caption="SET2B Phase: read '0' write '1'" value="0xB"/>
        <value name="CLEAR1" caption="CLEAR1 Phase: read '1' write '0'" value="0xC"/>
        <value name="CLEAR2" caption="CLEAR2 Phase: read '0' write '1'" value="0xD"/>
        <value name="CLEAR2B" caption="CLEAR2B Phase: read '1' write '0'" value="0xE"/>
        <value name="READ" caption="READ Phase: check memory is cleared" value="0xF"/>
      </value-group>
      <value-group name="CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger x rises when DCC is read and falls when it is written" value="0"/>
        <value name="FULL" caption="Trigger x rises when DCC is written and falls when it is read" value="1"/>
      </value-group>
      <value-group name="MBFI0__AMMOD">
        <value name="ADDR" caption="Address match, fault injected when the masked master address matches with the masked bcc1.addr" value="0x0"/>
        <value name="ALWAYS" caption="Always matches, fault injected every AHB access" value="0x1"/>
      </value-group>
      <value-group name="MBFI0__FTYPE">
        <value name="STUCKAT0" caption="Stuck At 0" value="0x0"/>
        <value name="STUCKAT1" caption="Stuck At 1" value="0x1"/>
      </value-group>
      <value-group name="STATUSC__STATE">
        <value name="IDLE" caption="State Machine Ready" value="0x0"/>
        <value name="MBIST_FILL" caption="MBIST fill memory with zeroes" value="0x8"/>
        <value name="MBIST_SET1" caption="SET1 Phase: read '0' write '1'" value="0x9"/>
        <value name="MBIST_SET2" caption="SET2 Phase: read '1' write '0'" value="0xA"/>
        <value name="MBIST_SET2B" caption="SET2B Phase: read '0' write '1'" value="0xB"/>
        <value name="MBIST_CLEAR1" caption="CLEAR1 Phase: read '1' write '0'" value="0xC"/>
        <value name="MBIST_CLEAR2" caption="CLEAR2 Phase: read '0' write '1'" value="0xD"/>
        <value name="MBIST_CLEAR2B" caption="CLEAR2B Phase: read '1' write '0'" value="0xE"/>
        <value name="MBIST_READ" caption="READ Phase: check memory is cleared" value="0xF"/>
      </value-group>
      <value-group name="DAL__CPU">
        <value name="SECURED" caption="Debugger targeting CPU0 domain can only access the DSU external address space otherwise debugger access is disabled" value="0x0"/>
        <value name="NS_DEBUG" caption="Debugger can access only non-secure regions" value="0x1"/>
        <value name="FULL_DEBUG" caption="Debugger can access secure and non-secure regions" value="0x2"/>
        <value name="UNIMPLEMENTED" caption="No CPU in this slot" value="0x3"/>
      </value-group>
    </module>
    <module name="DWT" id="SYSTEM_IP" version="1.0.0" caption="Data Watchpoint and Trace">
      <register-group name="COMPARATOR" size="0x10">
        <register name="COMP" offset="0x0" rw="RW" size="4" access-size="4" caption="DWT Comparator Register n">
          <bitfield name="VALUE" caption="Cycle/PC/data value or data address" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUNCTION" offset="0x8" rw="RW" size="4" access-size="4" caption="DWT Function Register x">
          <bitfield name="MATCH" caption="Match type" mask="0xF"/>
          <bitfield name="ACTION" caption="Action on match" mask="0x30"/>
          <bitfield name="DATAVSIZE" caption="Data value size" mask="0xC00"/>
          <bitfield name="MATCHED" caption="Comparator matched" mask="0x1000000"/>
          <bitfield name="ID" caption="Identify capability" mask="0xF8000000"/>
        </register>
      </register-group>
      <register-group name="DWT" caption="Data Watchpoint and Trace">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0B000000" caption="DWT Control Register">
          <bitfield name="CYCCNTENA" caption="CYCCNT enable" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="POSTCNT preset" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="POSTCNT initial" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="Cycle count tap" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="Synchronization tap" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="PC sample enable" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="Exception trace enable" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="CPI event enable" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="Exception event enable" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="Sleep event enable" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="LSU event enable" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="Fold event enable" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="Cycle event enable" mask="0x400000"/>
          <bitfield name="CYCDISS" caption="Cycle counter disabled secure" mask="0x800000"/>
          <bitfield name="NOPRFCNT" caption="No profile counters" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="No cycle count" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="No external triggers" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="No trace packets" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="Number of comparators" mask="0xF0000000"/>
        </register>
        <register name="CYCCNT" offset="0x4" rw="RW" size="4" access-size="4" caption="DWT Cycle Count Register">
          <bitfield name="CYCCNT" caption="Incrementing cycle counter value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CPICNT" offset="0x8" rw="RW" size="4" access-size="4" caption="DWT CPI Count Register">
          <bitfield name="CPICNT" caption="Base instruction overhead counter" mask="0xFF"/>
        </register>
        <register name="EXCCNT" offset="0xC" rw="RW" size="4" access-size="4" caption="DWT Exception Overhead Count Register">
          <bitfield name="EXCCNT" caption="Exception overhead counter" mask="0xFF"/>
        </register>
        <register name="SLEEPCNT" offset="0x10" rw="RW" size="4" access-size="4" caption="DWT Sleep Count Register">
          <bitfield name="SLEEPCNT" caption="Sleep counter" mask="0xFF"/>
        </register>
        <register name="LSUCNT" offset="0x14" rw="RW" size="4" access-size="4" caption="DWT LSU Count Register">
          <bitfield name="LSUCNT" caption="Load-store overhead counter" mask="0xFF"/>
        </register>
        <register name="FOLDCNT" offset="0x18" rw="RW" size="4" access-size="4" caption="DWT Folded Instruction Count Register">
          <bitfield name="FOLDCNT" caption="Folded instruction counter" mask="0xFF"/>
        </register>
        <register name="PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="DWT Program Counter Sample Register">
          <bitfield name="EIASAMPLE" caption="Executed instruction address sample" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="COMPARATOR" name-in-module="COMPARATOR" offset="0x020" size="0x10" count="4"/>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="DWT Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="LAR__KEY"/>
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="DWT Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A02" caption="DWT Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
