Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/atdf/PIC32CK2051SG00144.atdf
        <register name="STATUS" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="NVM Status Register">
          <bitfield name="BUSY" caption="NVM Busy Status" mask="0x1"/>
          <bitfield name="HTDRDY" caption="High Temp Detect Ready Status" mask="0x100"/>
        </register>
        <register name="KEY" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="SFR Unlock Register">
          <bitfield name="KEYVALUE" caption="NVM SFR Key Value" mask="0xFF"/>
          <bitfield name="KEYCODE" caption="NVM SFR Key Code" mask="0xFFFFFF00"/>
        </register>
        <register name="ADDR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Flash Address Register">
          <bitfield name="ADDR" caption="Flash Address used by NVMOP" mask="0xFFFFFFFC"/>
        </register>
        <register name="SRCADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Source Data Address Register">
          <bitfield name="SRCADDR" caption="Source Data (Word) Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0x28" rw="RW" size="4" count="8" initval="0x00000000" caption="Flash Write Data Register">
          <bitfield name="DATA" caption="Flash Write Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SWAP" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="NVM Panel Swap Register">
          <bitfield name="BFSWAP" caption="BFM Swap Status/Control Bit" mask="0x1"/>
          <bitfield name="BFSLOCK" caption="BFM Swap Lock Bit" mask="0x2"/>
          <bitfield name="PFSWAP" caption="PFM Swap Status/Control Bit" mask="0x100"/>
          <bitfield name="PFSLOCK" caption="PFM Swap Lock Bit" mask="0x200"/>
        </register>
        <register name="PWP" offset="0x4C" rw="RW" size="4" count="8" initval="0x00000000" caption="PFM Write Protect Region 0">
          <bitfield name="PWPSIZE" caption="PWP Region 0 Size in 4KB pages" mask="0xFFF"/>
          <bitfield name="PWPMIR" caption="Mirror PWP 0 bit" mask="0x2000"/>
          <bitfield name="PWPLOCK" caption="PWP Region 0 Lock Bit" mask="0x4000"/>
          <bitfield name="PWPEN" caption="PWP Region 0 Enable Bit" mask="0x8000"/>
          <bitfield name="PWPBASE" caption="PWP Region 0 Base Address - 4KB Page Aligned" mask="0xFFF0000"/>
        </register>
        <register name="LBWP" offset="0x6C" rw="RW" size="4" initval="0x0000FFFF" caption="Lower BFM Write Protect Register">
          <bitfield name="LBWP" caption="Lower Boot Pages Write Protect Bits" mask="0xFFFF"/>
          <bitfield name="LBWPLOCK" caption="LBWP Lock Bit" mask="0x80000000"/>
        </register>
        <register name="UBWP" offset="0x70" rw="RW" size="4" initval="0x0000FFFF" caption="Upper BFM Write Protect Register">
          <bitfield name="UBWP" caption="Upper Boot Pages Write Protect Bits" mask="0xFFFF"/>
          <bitfield name="UBWPLOCK" caption="UBWP Register Lock Bit" mask="0x80000000"/>
        </register>
        <register name="UOWP" offset="0x74" rw="RW" size="4" initval="0x00000F0F" caption="User OTP Write Protect Register">
          <bitfield name="UO1WP" caption="User OTP Page 1 Write Protect Row Bit" mask="0xF"/>
          <bitfield name="UO2WP" caption="User OTP Page 2 Write Protect Row Bit" mask="0xF00"/>
          <bitfield name="UO1WPRLOCK" caption="User OTP Page 1 WP Row Lock Bit" mask="0xF0000"/>
          <bitfield name="UO2WPRLOCK" caption="User OTP Page 2 WP Row Lock Bit" mask="0xF000000"/>
        </register>
        <register name="CWP" offset="0x78" rw="RW" size="4" initval="0x00000505" caption="CFM Page Write Protect Register">
          <bitfield name="UC1WP" caption="User Configuration Page 1 Write Protect Bit" mask="0x1"/>
          <bitfield name="BC1WP" caption="Boot Configuration Page 1 Write Protect Bit" mask="0x4"/>
          <bitfield name="UC2WP" caption="User Configuration Page 2 Write Protect Bit" mask="0x100"/>
          <bitfield name="BC2WP" caption="Boot Configuration Page 2 Write Protect Bit" mask="0x400"/>
          <bitfield name="UC1WPLOCK" caption="User Configuration Page 1 WP Lock Bit" mask="0x10000"/>
          <bitfield name="BC1WPLOCK" caption="Boot Configuration Page 1 WP Lock Bit" mask="0x40000"/>
          <bitfield name="UC2WPLOCK" caption="User Configuration Page 2 WP Lock Bit" mask="0x1000000"/>
          <bitfield name="BC2WPLOCK" caption="Boot Configuration Page 2 WP Lock Bit" mask="0x4000000"/>
        </register>
        <register name="HSMINTENCLR" offset="0x80" rw="RW" size="4" atomic-op="clear:HSMINTENCLR" initval="0x00000000" caption="HSM NVM Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Enable Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Interrupt Enable Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Enable Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Enable Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Interrupt Enable Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Interrupt Enable Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Interrupt Enable Bit" mask="0x2000"/>
        </register>
        <register name="HSMINTENSET" offset="0x84" rw="RW" size="4" atomic-op="set:HSMINTENSET" initval="0x00000000" caption="HSM NVM Interrupt Enable SET Register">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Enable Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Interrupt Enable Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Enable Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Enable Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Interrupt Enable Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Interrupt Enable Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Interrupt Enable Bit" mask="0x2000"/>
        </register>
        <register name="HSMINTFLAG" offset="0x88" rw="RW" size="4" atomic-op="clear:HSMINTFLAG" initval="0x00000000" caption="HSM NVM Interrupt Flag Register">
          <bitfield name="DONE" caption="NVM Operation Done Flag Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Flag Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Flag Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Flag Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Flag Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Flag Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Flag Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Flag Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Flag Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Flag Bit" mask="0x2000"/>
        </register>
        <register name="HSMCWP" offset="0x8C" rw="RW" size="4" initval="0x0000F000" caption="HSM CFG Write Protect Register">
          <bitfield name="HCWP" caption="HSM CFG Page Write Protect Bits" mask="0xF000"/>
          <bitfield name="HCWPLOCK" caption="HSMCWP Register Lock Bit" mask="0xF0000000"/>
        </register>
        <register name="HSMLDAT" offset="0x90" rw="RW" size="4" count="8" initval="0xFFFFFFFF" caption="HSM Tamper Lower Overwrite Data Register">
        </register>
